DarrylGamroth/smartstepper/drivers/pwm/mcpwm_stm32.c
/*
 * Copyright (c) 2016 Linaro Limited.
 * Copyright (c) 2020 Teslabs Engineering S.L.
 * Copyright (c) 2023 Nobleo Technology
 * Copyright (c) 2025 Rubus Technologies Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_mcpwm

#include <errno.h>

#include <soc.h>
#include <stm32_ll_rcc.h>
#include <stm32_ll_tim.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/device.h>
#include <zephyr/kernel.h>
#include <zephyr/init.h>
#include <zephyr/dsp/types.h>

#include <zephyr/sys/util.h>

#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/dt-bindings/pwm/stm32_pwm.h>

#include <drivers/mcpwm.h>
#include <dt-bindings/pwm/stm32-mcpwm.h>

#include <zephyr/logging/log.h>
#include <zephyr/irq.h>

LOG_MODULE_REGISTER(DT_DRV_COMPAT, CONFIG_PWM_LOG_LEVEL);

/* L0 series MCUs only have 16-bit timers and don't have below macro defined */
#ifndef IS_TIM_32B_COUNTER_INSTANCE
#define IS_TIM_32B_COUNTER_INSTANCE(INSTANCE) (0)
#endif

#if defined(TIM_BREAK_INPUT_SUPPORT)
static const uint32_t break_polarity[] = {LL_TIM_BREAK_POLARITY_LOW, LL_TIM_BREAK_POLARITY_HIGH};
#else
static const uint32_t break_polarity[] = {0};
#endif

#if defined(TIM_BDTR_BKBID)
static const uint32_t break2_polarity[] = {LL_TIM_BREAK2_POLARITY_LOW, LL_TIM_BREAK2_POLARITY_HIGH};
#else
static const uint32_t break2_polarity[] = {0};
#endif

#if !defined(CONFIG_SOC_SERIES_STM32L0X) && !defined(CONFIG_SOC_SERIES_STM32L1X)
static const uint32_t lock_level[] = {LL_TIM_LOCKLEVEL_OFF, LL_TIM_LOCKLEVEL_1, LL_TIM_LOCKLEVEL_2,
				      LL_TIM_LOCKLEVEL_3};
#else
static const uint32_t lock_level[] = {0};
#endif

/** Maximum number of timer channels : some stm32 soc have 6 else only 4 */
#if defined(LL_TIM_CHANNEL_CH6)
#define TIMER_HAS_6CH 1
#define TIMER_MAX_CH  6u
#else
#define TIMER_HAS_6CH 0
#define TIMER_MAX_CH  4u
#endif

/** PWM data. */
struct mcpwm_stm32_data {
	/** Timer clock (Hz). */
	uint32_t tim_clk;
	/** Calculated period cycles (adjusted for counter mode). */
	uint32_t period_cycles;
	uint32_t period_cycles_x2;
	/* Reset controller device configuration */
	const struct reset_dt_spec reset;
	/* User break callback */
	mcpwm_break_cb_t break_cb;
	void *break_user_data;
	/* Output compare callbacks */
	mcpwm_compare_cb_t compare_cb[TIMER_MAX_CH];
	void *compare_user_data[TIMER_MAX_CH];
	/* Per-channel configuration flags */
	mcpwm_flags_t channel_flags[TIMER_MAX_CH];
};

/** PWM configuration. */
struct mcpwm_stm32_config {
	TIM_TypeDef *timer;
	uint32_t prescaler;
	uint32_t countermode;
	uint32_t trigger_selection;
	uint32_t master_mode_selection;
	uint32_t slave_mode_selection;
	uint32_t repetition_counter;
	uint32_t ossr;
	uint32_t ossi;
	uint32_t dead_time;
	uint32_t lock_level;
	uint32_t break_polarity;
	uint32_t break2_polarity;
	uint32_t period_ns;
	uint32_t cc_dma_channels_mask;
	bool master_mode;
	bool slave_mode;
	bool trigger_polarity;
	bool one_pulse_mode;
	bool break_enable;
	bool break2_enable;
	bool automatic_output;
	const struct stm32_pclken *pclken;
	size_t pclk_len;
	const struct pinctrl_dev_config *pcfg;
	void (*irq_config_func)(const struct device *dev);
};

/** Channel to LL mapping. */
static const uint32_t ch2ll[TIMER_MAX_CH] = {
	LL_TIM_CHANNEL_CH1, LL_TIM_CHANNEL_CH2, LL_TIM_CHANNEL_CH3, LL_TIM_CHANNEL_CH4,
#if TIMER_HAS_6CH
	LL_TIM_CHANNEL_CH5, LL_TIM_CHANNEL_CH6
#endif
};

/** STM32 MCUs have between 1 and 4 complementary channels */
static const uint32_t ch2ll_n[] = {
#if defined(LL_TIM_CHANNEL_CH1N)
	LL_TIM_CHANNEL_CH1N,
#if defined(LL_TIM_CHANNEL_CH2N)
	LL_TIM_CHANNEL_CH2N,
#if defined(LL_TIM_CHANNEL_CH3N)
	LL_TIM_CHANNEL_CH3N,
#if defined(LL_TIM_CHANNEL_CH4N)
	LL_TIM_CHANNEL_CH4N,
#endif /* LL_TIM_CHANNEL_CH4N */
#endif /* LL_TIM_CHANNEL_CH3N */
#endif /* LL_TIM_CHANNEL_CH2N */
#endif /* LL_TIM_CHANNEL_CH1N */
};
/** Maximum number of complemented timer channels is ARRAY_SIZE(ch2ll_n)*/

/** Channel to compare set function mapping. */
static void (*const set_timer_compare[TIMER_MAX_CH])(TIM_TypeDef *, uint32_t) = {
	LL_TIM_OC_SetCompareCH1, LL_TIM_OC_SetCompareCH2, LL_TIM_OC_SetCompareCH3,
	LL_TIM_OC_SetCompareCH4,
#if TIMER_HAS_6CH
	LL_TIM_OC_SetCompareCH5, LL_TIM_OC_SetCompareCH6
#endif
};

/** Channel to enable capture interrupt mapping. */
static void __maybe_unused (*const enable_capture_interrupt[])(TIM_TypeDef *) = {
	LL_TIM_EnableIT_CC1,
	LL_TIM_EnableIT_CC2,
	LL_TIM_EnableIT_CC3,
	LL_TIM_EnableIT_CC4
};

/** Channel to disable capture interrupt mapping. */
static void __maybe_unused (*const disable_capture_interrupt[])(TIM_TypeDef *) = {
	LL_TIM_DisableIT_CC1,
	LL_TIM_DisableIT_CC2,
	LL_TIM_DisableIT_CC3,
	LL_TIM_DisableIT_CC4
};

/* Channel is interrupt enabled mapping*/
static uint32_t __maybe_unused (*const is_capture_interrupt_enabled[])(const TIM_TypeDef *) = {
	LL_TIM_IsEnabledIT_CC1,
	LL_TIM_IsEnabledIT_CC2,
	LL_TIM_IsEnabledIT_CC3,
	LL_TIM_IsEnabledIT_CC4
};

/** Channel to is capture active flag mapping. */
#if !defined(CONFIG_SOC_SERIES_STM32MP1X)
static uint32_t __maybe_unused (*const is_capture_active[])(const TIM_TypeDef *) = {
#else
static uint32_t __maybe_unused (*const is_capture_active[])(TIM_TypeDef *) = {
#endif
	LL_TIM_IsActiveFlag_CC1,
	LL_TIM_IsActiveFlag_CC2,
	LL_TIM_IsActiveFlag_CC3,
	LL_TIM_IsActiveFlag_CC4,
#if TIMER_HAS_6CH
	LL_TIM_IsActiveFlag_CC5,
	LL_TIM_IsActiveFlag_CC6
#endif
};

/** Channel to clearing capture flag mapping. */
static void __maybe_unused (*const clear_capture_interrupt[])(TIM_TypeDef *) = {
	LL_TIM_ClearFlag_CC1,
	LL_TIM_ClearFlag_CC2,
	LL_TIM_ClearFlag_CC3,
	LL_TIM_ClearFlag_CC4,
#if TIMER_HAS_6CH
	LL_TIM_ClearFlag_CC5,
	LL_TIM_ClearFlag_CC6
#endif
};

static void (*const enable_cc_dma[])(TIM_TypeDef *) = {
	LL_TIM_EnableDMAReq_CC1, LL_TIM_EnableDMAReq_CC2, LL_TIM_EnableDMAReq_CC3,
	LL_TIM_EnableDMAReq_CC4};

static void (*const disable_cc_dma[])(TIM_TypeDef *) = {
	LL_TIM_DisableDMAReq_CC1, LL_TIM_DisableDMAReq_CC2, LL_TIM_DisableDMAReq_CC3,
	LL_TIM_DisableDMAReq_CC4};

/**
 * Obtain LL polarity from PWM flags.
 *
 * @param flags PWM flags.
 *
 * @return LL polarity.
 */
static uint32_t get_polarity(mcpwm_flags_t flags)
{
	if ((flags & PWM_POLARITY_MASK) == PWM_POLARITY_NORMAL) {
		return LL_TIM_OCPOLARITY_HIGH;
	}

	return LL_TIM_OCPOLARITY_LOW;
}

/**
 * Obtain LL output compare mode from PWM flags.
 *
 * @param flags PWM flags.
 *
 * @return LL output compare mode.
 */
static uint32_t get_output_compare_mode(mcpwm_flags_t flags)
{
	uint32_t mode_flags = flags & STM32_PWM_OC_MODE_MASK;

	if (mode_flags == STM32_PWM_OC_MODE_PWM2) {
		return LL_TIM_OCMODE_PWM2;
	}

	/* Default to PWM1 mode */
	return LL_TIM_OCMODE_PWM1;
}

/**
 * Obtain LL idle state from PWM flags.
 *
 * @param flags PWM flags.
 *
 * @return LL idle state.
 */
static uint32_t get_idle_state(mcpwm_flags_t flags)
{
	uint32_t idle_flags = flags & STM32_PWM_IDLE_STATE_MASK;

	if (idle_flags == STM32_PWM_IDLE_STATE_HIGH) {
		return LL_TIM_OCIDLESTATE_HIGH;
	}

