DarrylGamroth/smartstepper/drivers/pwm/mcpwm_stm32.c
	/* Default to low idle state */
	return LL_TIM_OCIDLESTATE_LOW;
}

/**
 * @brief  Check if LL counter mode is center-aligned.
 *
 * @param  ll_countermode LL counter mode.
 *
 * @return `true` when center-aligned, otherwise `false`.
 */
static inline bool is_center_aligned(const uint32_t ll_countermode)
{
	return ((ll_countermode == LL_TIM_COUNTERMODE_CENTER_DOWN) ||
		(ll_countermode == LL_TIM_COUNTERMODE_CENTER_UP) ||
		(ll_countermode == LL_TIM_COUNTERMODE_CENTER_UP_DOWN));
}

static void mcpwm_stm32_brk_isr(const struct device *dev)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	struct mcpwm_stm32_data *data = dev->data;
	TIM_TypeDef *timer = cfg->timer;
	bool break_occurred = false;

	if (!IS_TIM_BREAK_INSTANCE(timer)) {
		return;
	}

	if (LL_TIM_IsActiveFlag_BRK(timer)) {
		LL_TIM_ClearFlag_BRK(timer);
		break_occurred = true;
	}

#if defined(IS_TIM_BKIN2_INSTANCE)
	if (IS_TIM_BKIN2_INSTANCE(timer) && LL_TIM_IsActiveFlag_BRK2(timer)) {
		LL_TIM_ClearFlag_BRK2(timer);
		break_occurred = true;
	}
#endif

	if (break_occurred && data->break_cb != NULL) {
		data->break_cb(dev, data->break_user_data);
	}
}

static int mcpwm_stm32_configure(const struct device *dev, uint32_t channel, mcpwm_flags_t flags)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	struct mcpwm_stm32_data *data = dev->data;
	TIM_TypeDef *timer = cfg->timer;

	uint32_t ll_channel;
	uint32_t current_ll_channel;
	uint32_t negative_ll_channel = 0;

	if (channel < 1U || channel > TIMER_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	/* Store flags for this channel */
	data->channel_flags[channel - 1U] = flags;

	ll_channel = ch2ll[channel - 1U];

	if ((channel - 1U) < ARRAY_SIZE(ch2ll_n)) {
		negative_ll_channel = ch2ll_n[channel - 1U];
	} else {
		negative_ll_channel = 0;
	}

	/* in LL_TIM_CC_DisableChannel and LL_TIM_CC_IsEnabledChannel,
	 * the channel param could be the complementary one
	 */
	if ((flags & STM32_PWM_COMPLEMENTARY_MASK) == STM32_PWM_COMPLEMENTARY) {
		if (!negative_ll_channel) {
			LOG_ERR("Channel %d has no complementary output", channel);
			return -EINVAL;
		}
		current_ll_channel = negative_ll_channel;
	} else {
		current_ll_channel = ll_channel;
	}

	LL_TIM_OC_SetPolarity(timer, current_ll_channel, get_polarity(flags));

	if (!LL_TIM_CC_IsEnabledChannel(timer, current_ll_channel)) {
		LL_TIM_OC_SetMode(timer, ll_channel, get_output_compare_mode(flags));
#ifdef LL_TIM_OCIDLESTATE_LOW
		LL_TIM_OC_SetIdleState(timer, current_ll_channel, get_idle_state(flags));
#endif
	}

	return 0;
}

static int mcpwm_stm32_enable(const struct device *dev, uint32_t channel)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	struct mcpwm_stm32_data *data = dev->data;
	TIM_TypeDef *timer = cfg->timer;
	uint32_t ll_channel;
	uint32_t channels_to_enable;
	mcpwm_flags_t flags;

	if (channel < 1U || channel > TIMER_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	/* Use stored configuration flags */
	flags = data->channel_flags[channel - 1U];

	ll_channel = ch2ll[channel - 1U];
	channels_to_enable = ll_channel;

	/* Add complementary channel only if explicitly requested */
	if ((flags & STM32_PWM_COMPLEMENTARY_MASK) == STM32_PWM_COMPLEMENTARY) {
		if ((channel - 1U) < ARRAY_SIZE(ch2ll_n)) {
			channels_to_enable |= ch2ll_n[channel - 1U];
		} else {
			LOG_ERR("Channel %d has no complementary output", channel);
			return -EINVAL;
		}
	}

	if ((cfg->cc_dma_channels_mask & BIT(channel - 1U)) != 0U) {
		enable_cc_dma[channel - 1U](timer);
	}

	LL_TIM_CC_EnableChannel(timer, channels_to_enable);

	return 0;
}

static int mcpwm_stm32_disable(const struct device *dev, uint32_t channel)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	struct mcpwm_stm32_data *data = dev->data;
	TIM_TypeDef *timer = cfg->timer;
	uint32_t ll_channel;
	uint32_t channels_to_disable;
	mcpwm_flags_t flags;

	if (channel < 1U || channel > TIMER_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	/* Use stored configuration flags */
	flags = data->channel_flags[channel - 1U];

	ll_channel = ch2ll[channel - 1U];
	channels_to_disable = ll_channel;

	/* Add complementary channel only if explicitly requested */
	if ((flags & STM32_PWM_COMPLEMENTARY_MASK) == STM32_PWM_COMPLEMENTARY) {
		if ((channel - 1U) < ARRAY_SIZE(ch2ll_n)) {
			channels_to_disable |= ch2ll_n[channel - 1U];
		} else {
			LOG_ERR("Channel %d has no complementary output", channel);
			return -EINVAL;
		}
	}

	if ((cfg->cc_dma_channels_mask & BIT(channel - 1U)) != 0U) {
		disable_cc_dma[channel - 1U](timer);
	}

	LL_TIM_CC_DisableChannel(timer, channels_to_disable);

	return 0;
}

static int mcpwm_stm32_set_duty_cycle(const struct device *dev, uint32_t channel, q31_t duty_cycle)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	const struct mcpwm_stm32_data *data = dev->data;

	if (channel < 1U || channel > TIMER_MAX_CH) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	uint32_t pulse_cycles =
		(int32_t)(((int64_t)duty_cycle * data->period_cycles + 0x40000000LL) >> 31);

	set_timer_compare[channel - 1U](cfg->timer, pulse_cycles);
	return 0;
}

static int mcpwm_stm32_period_ns_to_cycles(const struct device *dev, uint64_t period_ns,
					   uint32_t *period_cycles_out)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	struct mcpwm_stm32_data *data = dev->data;
	TIM_TypeDef *timer = cfg->timer;
	uint64_t period_ns_calc;
	uint64_t period_cycles_calc;
	uint32_t period_cycles;

	if (period_cycles_out == NULL || period_ns == 0U) {
		return -EINVAL;
	}
	if (period_ns > (UINT64_MAX / data->tim_clk)) {
		LOG_ERR("Period too large, would cause overflow");
		return -EINVAL;
	}

	period_ns_calc = (uint64_t)data->tim_clk * period_ns;
	period_cycles_calc = DIV_ROUND_UP(period_ns_calc, NSEC_PER_SEC);
	if (period_cycles_calc > UINT32_MAX) {
		LOG_ERR("Period too large for 32-bit timer: %llu cycles",
			(unsigned long long)period_cycles_calc);
		return -EINVAL;
	}
	period_cycles = (uint32_t)period_cycles_calc;
	if (period_cycles == 0U) {
		return -EINVAL;
	}

	if (is_center_aligned(cfg->countermode)) {
		period_cycles /= 2U;
		if (period_cycles == 0U) {
			period_cycles = 1U;
		}
	} else {
		period_cycles -= 1U;
	}

	if (!IS_TIM_32B_COUNTER_INSTANCE(timer) && period_cycles > UINT16_MAX) {
		LOG_ERR("Period too large for 16-bit timer: %u", period_cycles);
		return -EINVAL;
	}

	*period_cycles_out = period_cycles;
	return 0;
}

static void mcpwm_stm32_apply_period_cycles(const struct device *dev, uint32_t period_cycles)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	struct mcpwm_stm32_data *data = dev->data;

	data->period_cycles = period_cycles;
	data->period_cycles_x2 = period_cycles * 2U;
	LL_TIM_SetAutoReload(cfg->timer, period_cycles);
	LL_TIM_GenerateEvent_UPDATE(cfg->timer);
}

