DarrylGamroth/smartstepper/drivers/pwm/mcpwm_stm32.c
static int mcpwm_stm32_set_period_ns(const struct device *dev, uint64_t period_ns)
{
	uint32_t period_cycles;
	int ret = mcpwm_stm32_period_ns_to_cycles(dev, period_ns, &period_cycles);
	if (ret != 0) {
		return ret;
	}

	unsigned int key = irq_lock();
	mcpwm_stm32_apply_period_cycles(dev, period_cycles);
	irq_unlock(key);

	return 0;
}

static int mcpwm_stm32_set_compare_callback(const struct device *dev, uint32_t channel,
					    mcpwm_compare_cb_t callback, void *user_data)
{
	struct mcpwm_stm32_data *data = dev->data;
	const struct mcpwm_stm32_config *cfg = dev->config;
	TIM_TypeDef *timer = cfg->timer;
	uint32_t index = channel - 1U;
	unsigned int key;

	if ((channel < 1U) || (channel > 4U)) {
		LOG_ERR("Invalid channel (%d)", channel);
		return -EINVAL;
	}

	key = irq_lock();

	data->compare_cb[index] = callback;
	data->compare_user_data[index] = user_data;

	if (callback != NULL) {
		clear_capture_interrupt[index](timer);
		enable_capture_interrupt[index](timer);
	} else {
		disable_capture_interrupt[index](timer);
	}

	irq_unlock(key);

	LOG_DBG("Compare callback %s for PWM device %s channel %d",
		callback != NULL ? "registered" : "cleared", dev->name, channel);

	return 0;
}

static int mcpwm_stm32_set_break_callback(const struct device *dev, mcpwm_break_cb_t callback,
					  void *user_data)
{
	struct mcpwm_stm32_data *data = dev->data;
	const struct mcpwm_stm32_config *cfg = dev->config;
	TIM_TypeDef *timer = cfg->timer;
	unsigned int key;

	if (!IS_TIM_BREAK_INSTANCE(timer)) {
		return callback != NULL ? -ENOTSUP : 0;
	}

	key = irq_lock();
	data->break_cb = callback;
	data->break_user_data = user_data;

	if (callback != NULL) {
		LL_TIM_ClearFlag_BRK(timer);
#if defined(IS_TIM_BKIN2_INSTANCE)
		if (IS_TIM_BKIN2_INSTANCE(timer)) {
			LL_TIM_ClearFlag_BRK2(timer);
		}
#endif
		LL_TIM_EnableIT_BRK(timer);
	} else {
		LL_TIM_DisableIT_BRK(timer);
	}
	irq_unlock(key);

	return 0;
}

static int mcpwm_stm32_start(const struct device *dev)
{
	const struct mcpwm_stm32_config *cfg = dev->config;
	TIM_TypeDef *timer = cfg->timer;

	/* Reset counter and generate update event for master timers only
	 * Slave timers are controlled by master's trigger signals
	 */
	if (!cfg->slave_mode) {
		LL_TIM_SetCounter(timer, 0);
		LL_TIM_GenerateEvent_UPDATE(timer);
	}

#if !defined(CONFIG_SOC_SERIES_STM32L0X) && !defined(CONFIG_SOC_SERIES_STM32L1X)
	/* Enable all outputs (MOE bit) - also recovers from break faults */
	if (IS_TIM_BREAK_INSTANCE(timer)) {
		LL_TIM_EnableAllOutputs(timer);
	}
#endif

	/* Enable counter for master timers only
	 * Slave timers start automatically via hardware trigger
	 */
	if (!cfg->slave_mode) {
		LL_TIM_EnableCounter(timer);
	}

	LOG_DBG("Timer %s for PWM device %s", 
		cfg->slave_mode ? "outputs enabled" : "started", dev->name);
	return 0;
}

static int mcpwm_stm32_stop(const struct device *dev)
{
	const struct mcpwm_stm32_config *cfg = dev->config;

	LL_TIM_DisableCounter(cfg->timer);

	LOG_DBG("Timer stopped for PWM device %s", dev->name);
	return 0;
}

static DEVICE_API(mcpwm, mcpwm_stm32_driver_api) = {
	.configure = mcpwm_stm32_configure,
	.enable = mcpwm_stm32_enable,
	.disable = mcpwm_stm32_disable,
	.start = mcpwm_stm32_start,
	.stop = mcpwm_stm32_stop,
	.set_duty_cycle = mcpwm_stm32_set_duty_cycle,
	.set_period_ns = mcpwm_stm32_set_period_ns,
	.set_compare_callback = mcpwm_stm32_set_compare_callback,
	.set_break_callback = mcpwm_stm32_set_break_callback,
};

static int mcpwm_stm32_init(const struct device *dev)
{
	struct mcpwm_stm32_data *data = dev->data;
	const struct mcpwm_stm32_config *cfg = dev->config;
	TIM_TypeDef *timer = cfg->timer;
	const struct device *clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	uint32_t tim_clk;
	int r;

	if (!device_is_ready(clk)) {
		LOG_ERR("clock control device not ready");
		return -ENODEV;
	}

	/* Enable clock and store its speed */
	r = clock_control_on(clk, (clock_control_subsys_t)&cfg->pclken[0]);
	if (r < 0) {
		LOG_ERR("Could not initialize clock (%d)", r);
		return r;
	}

	if (cfg->pclk_len > 1) {
		/* Enable Timer clock source */
		r = clock_control_configure(clk, (clock_control_subsys_t)&cfg->pclken[1], NULL);
		if (r != 0) {
			LOG_ERR("Could not configure clock (%d)", r);
			return r;
		}

		r = clock_control_get_rate(clk, (clock_control_subsys_t)&cfg->pclken[1], &tim_clk);
		if (r < 0) {
			LOG_ERR("Timer clock rate get error (%d)", r);
			return r;
		}
	} else {
		LOG_ERR("Timer clock source is not specified");
		return -EINVAL;
	}

	data->tim_clk = tim_clk;

	/* Reset timer to default state using RCC */
	(void)reset_line_toggle_dt(&data->reset);

	/* configure pinmux - only if pinctrl is provided */
	if (cfg->pcfg != NULL) {
		r = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
		if (r < 0) {
			LOG_ERR("PWM pinctrl setup failed (%d)", r);
			return r;
		}
		LOG_DBG("Pinctrl configured for timer %s", dev->name);
	} else {
		LOG_DBG("No pinctrl configured for timer %s (timer-only mode)", dev->name);
	}

	uint32_t period_cycles;
	r = mcpwm_stm32_period_ns_to_cycles(dev, cfg->period_ns, &period_cycles);
	if (r != 0) {
		return r;
	}

	/* initialize timer */
	LL_TIM_SetPrescaler(timer, cfg->prescaler);
	mcpwm_stm32_apply_period_cycles(dev, period_cycles);

	if (IS_TIM_COUNTER_MODE_SELECT_INSTANCE(timer)) {
		LL_TIM_SetCounterMode(timer, cfg->countermode);
	}

	if (IS_TIM_CLOCK_DIVISION_INSTANCE(timer)) {
		LL_TIM_SetClockDivision(timer, LL_TIM_CLOCKDIVISION_DIV1);
	}

#ifdef IS_TIM_REPETITION_COUNTER_INSTANCE
	if (IS_TIM_REPETITION_COUNTER_INSTANCE(timer)) {
		LL_TIM_SetRepetitionCounter(timer, cfg->repetition_counter);
	}
#endif

	/* Enable auto-reload preload (affects all channels) */
	LL_TIM_EnableARRPreload(timer);

	if (cfg->master_mode) {
		/* Configure master mode trigger output */
		LL_TIM_SetTriggerOutput(timer, cfg->master_mode_selection);
		/* Enable MSM to synchronize TRGO with trigger input (if slave) */
		LL_TIM_EnableMasterSlaveMode(timer);
	}

	if (cfg->slave_mode) {
		/* Configure slave mode trigger input */
		LL_TIM_SetSlaveMode(timer, cfg->slave_mode_selection);
		LL_TIM_SetTriggerInput(timer, cfg->trigger_selection);

		/* Configure ETR if using external trigger */
		if (cfg->trigger_selection == LL_TIM_TS_ETRF) {
			LL_TIM_ConfigETR(timer,
					 cfg->trigger_polarity ? LL_TIM_ETR_POLARITY_INVERTED
							       : LL_TIM_ETR_POLARITY_NONINVERTED,
					 LL_TIM_ETR_PRESCALER_DIV1, LL_TIM_ETR_FILTER_FDIV1);
		}
	}

	/* Configure one-pulse mode if enabled */
	if (cfg->one_pulse_mode) {
		LL_TIM_SetOnePulseMode(timer, LL_TIM_ONEPULSEMODE_SINGLE);
	} else {
		LL_TIM_SetOnePulseMode(timer, LL_TIM_ONEPULSEMODE_REPETITIVE);
	}

	LL_TIM_GenerateEvent_UPDATE(timer);

