DarrylGamroth/smartstepper/drivers/pwm/mcpwm_stm32.c
	cfg->irq_config_func(dev);

#if !defined(CONFIG_SOC_SERIES_STM32L0X) && !defined(CONFIG_SOC_SERIES_STM32L1X)
	if (IS_TIM_BREAK_INSTANCE(timer)) {
		/* Configure off-states behavior */
		LL_TIM_SetOffStates(timer,
				    cfg->ossi ? LL_TIM_OSSI_ENABLE : LL_TIM_OSSI_DISABLE,
				    cfg->ossr ? LL_TIM_OSSR_ENABLE : LL_TIM_OSSR_DISABLE);

		/* Configure dead time */
		if (cfg->dead_time > 0) {
			LL_TIM_OC_SetDeadTime(timer, cfg->dead_time);
		}

		/* Configure lock level */
		if (cfg->lock_level > 0) {
			LL_TIM_CC_SetLockLevel(timer, cfg->lock_level);
		}

		/* Configure break input 1 */
		if (cfg->break_enable) {
#if defined(TIM_BDTR_BKBID)
			LL_TIM_ConfigBRK(timer, cfg->break_polarity, LL_TIM_BREAK_FILTER_FDIV1,
					 LL_TIM_BREAK_AFMODE_INPUT);
#elif defined(LL_TIM_BREAK_FILTER_FDIV1)
			LL_TIM_ConfigBRK(timer, cfg->break_polarity, LL_TIM_BREAK_FILTER_FDIV1);
#else
			LL_TIM_ConfigBRK(timer, cfg->break_polarity);
#endif
			LL_TIM_EnableBRK(timer);
		}

#if defined(IS_TIM_BKIN2_INSTANCE)
		/* Configure break input 2 if supported */
		if (IS_TIM_BKIN2_INSTANCE(timer) && cfg->break2_enable) {
#if defined(TIM_BDTR_BKBID)
			LL_TIM_ConfigBRK2(timer, cfg->break2_polarity,
					  LL_TIM_BREAK2_FILTER_FDIV1,
					  LL_TIM_BREAK2_AFMODE_INPUT);
#else
			LL_TIM_ConfigBRK2(timer, cfg->break2_polarity,
					  LL_TIM_BREAK2_FILTER_FDIV1);
#endif
			LL_TIM_EnableBRK2(timer);
		}
#endif

		/* Enable automatic output enable */
		if (cfg->automatic_output) {
			LL_TIM_EnableAutomaticOutput(timer);
		}
	}
#endif

	return 0;
}

#define PWM(index) DT_INST_PARENT(index)

#define IRQ_CONNECT_AND_ENABLE_BY_NAME_BRK(index)                                                  \
	do {                                                                                       \
		IRQ_CONNECT(DT_IRQ_BY_NAME(PWM(index), brk, irq),                                  \
			    DT_IRQ_BY_NAME(PWM(index), brk, priority), mcpwm_stm32_brk_isr,        \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_IRQ_BY_NAME(PWM(index), brk, irq));                                  \
	} while (0)

#define MCPWM_ISR_HANDLER(index)                                                                       \
	ISR_DIRECT_DECLARE(mcpwm_stm32_isr_##index)                                                    \
	{                                                                                              \
		const struct device *dev = DEVICE_DT_INST_GET(index);                                  \
		const struct mcpwm_stm32_config *cfg = dev->config;                                    \
		struct mcpwm_stm32_data *data = dev->data;                                             \
		TIM_TypeDef *timer = cfg->timer;                                                       \
                                                                                                       \
		for (uint32_t i = 0U; i < TIMER_MAX_CH; ++i) {                                         \
			if (is_capture_active[i](timer) != 0U) {                                       \
				clear_capture_interrupt[i](timer);                                     \
				mcpwm_compare_cb_t cb = data->compare_cb[i];                           \
				if (cb != NULL) {                                                      \
					cb(dev, i + 1U, data->compare_user_data[i]);                   \
				}                                                                      \
			}                                                                              \
		}                                                                                      \
                                                                                                       \
		return 0;                                                                              \
	}                                                                                              \
                                                                                                       \
	static void mcpwm_stm32_isr_##index##_init(void)                                               \
	{                                                                                              \
		COND_CODE_1(DT_IRQ_HAS_NAME(PWM(index), cc),                                         \
			    (IRQ_DIRECT_CONNECT(DT_IRQ_BY_NAME(PWM(index), cc, irq),                 \
						DT_IRQ_BY_NAME(PWM(index), cc, priority),        \
						mcpwm_stm32_isr_##index, 0);                     \
			     irq_enable(DT_IRQ_BY_NAME(PWM(index), cc, irq));),                      \
			    (IRQ_DIRECT_CONNECT(DT_IRQN(PWM(index)),                                 \
						DT_IRQ(PWM(index), priority),                    \
						mcpwm_stm32_isr_##index, 0);                     \
			     irq_enable(DT_IRQN(PWM(index)));)) \
	}

#define IRQ_CONFIG_FUNC(index)                                                                     \
	MCPWM_ISR_HANDLER(index)                                                                   \
	static void mcpwm_stm32_irq_config_func_##index(const struct device *dev)                  \
	{                                                                                          \
		struct mcpwm_stm32_data *data = dev->data;                                         \
		data->break_cb = NULL;                                                             \
		data->break_user_data = NULL;                                                      \
		for (uint32_t i = 0U; i < TIMER_MAX_CH; ++i) {                                     \
			data->compare_cb[i] = NULL;                                                \
			data->compare_user_data[i] = NULL;                                         \
		}                                                                                  \
		COND_CODE_1(DT_IRQ_HAS_NAME(PWM(index), brk),                                   \
			    (IRQ_CONNECT_AND_ENABLE_BY_NAME_BRK(index);), ());      \
		mcpwm_stm32_isr_##index##_init();                                                  \
	}

#define STM32_CC_DMA_MASK_BIT(node_id, prop, idx) BIT(DT_PROP_BY_IDX(node_id, prop, idx) - 1) |

#define STM32_CC_DMA_MASK(node_id)                                                                 \
	(DT_FOREACH_PROP_ELEM(node_id, st_cc_dma_channels, STM32_CC_DMA_MASK_BIT) 0U)

