DarrylGamroth/smartstepper/drivers/pwm/mcpwm_stm32.c
#define MCPWM_PINCTRL_DT_INST_DEFINE(index)                                                        \
	COND_CODE_1(DT_INST_PINCTRL_HAS_NAME(index, default), (PINCTRL_DT_INST_DEFINE(index)), ())

#define MCPWM_PINCTRL_DT_INST_DEV_CONFIG_GET(index)                                                \
	COND_CODE_1(DT_INST_PINCTRL_HAS_NAME(index, default),                                          \
		    (PINCTRL_DT_INST_DEV_CONFIG_GET(index)), (NULL))

DT_INST_FOREACH_STATUS_OKAY(IRQ_CONFIG_FUNC)

#define PWM_DEVICE_INIT(index)                                                                     \
	static struct mcpwm_stm32_data mcpwm_stm32_data_##index = {                                \
		.reset = RESET_DT_SPEC_GET(PWM(index)),                                            \
	};                                                                                         \
	MCPWM_PINCTRL_DT_INST_DEFINE(index);                                                       \
	static const struct stm32_pclken pclken_##index[] = STM32_DT_CLOCKS(PWM(index));           \
	static const struct mcpwm_stm32_config mcpwm_stm32_config_##index = {                      \
		.timer = (TIM_TypeDef *)DT_REG_ADDR(PWM(index)),                                   \
		.prescaler = DT_PROP(PWM(index), st_prescaler),                                    \
		.countermode = DT_PROP(PWM(index), st_countermode),                                \
		.master_mode = DT_PROP_OR(PWM(index), st_master_mode, false),                      \
		.slave_mode = DT_PROP_OR(PWM(index), st_slave_mode, false),                        \
		.trigger_selection = DT_PROP_OR(PWM(index), st_trigger_selection, 0),              \
		.trigger_polarity = DT_PROP_OR(PWM(index), st_trigger_polarity, false),            \
		.master_mode_selection = DT_PROP_OR(PWM(index), st_master_mode_selection, 0),      \
		.slave_mode_selection = DT_PROP_OR(PWM(index), st_slave_mode_selection, 0),        \
		.one_pulse_mode = DT_PROP_OR(PWM(index), st_one_pulse_mode, false),                \
		.repetition_counter = DT_PROP_OR(PWM(index), st_repetition_counter, 0),            \
		.automatic_output = DT_INST_PROP_OR(index, st_automatic_output, true),             \
		.lock_level = lock_level[DT_INST_ENUM_IDX_OR(index, st_lock_level, 0)],            \
		.ossr = DT_INST_PROP_OR(index, st_ossr, false),                                    \
		.ossi = DT_INST_PROP_OR(index, st_ossi, false),                                    \
		.period_ns = DT_INST_PROP(index, period),                                          \
		.cc_dma_channels_mask = COND_CODE_1(DT_INST_NODE_HAS_PROP(index, st_cc_dma_channels),                  \
				    (STM32_CC_DMA_MASK(DT_DRV_INST(index))), (0U)),                             \
			 .break_enable = DT_INST_PROP_OR(index, st_break_enable, false),           \
			 .break_polarity =                                                         \
				 break_polarity[DT_INST_ENUM_IDX_OR(index, st_break_polarity, 0)], \
			 .break2_enable = DT_INST_PROP_OR(index, st_break2_enable, false),         \
			 .break2_polarity = break2_polarity[DT_INST_ENUM_IDX_OR(                   \
				 index, st_break2_polarity, 0)],                                   \
			 .dead_time = DT_INST_PROP_OR(index, st_dead_time, 0),                     \
			 .pclken = pclken_##index, .pclk_len = DT_NUM_CLOCKS(PWM(index)),          \
			 .pcfg = MCPWM_PINCTRL_DT_INST_DEV_CONFIG_GET(index),                      \
			 .irq_config_func = mcpwm_stm32_irq_config_func_##index,                   \
	};                                                                                         \
	DEVICE_DT_INST_DEFINE(index, &mcpwm_stm32_init, NULL, &mcpwm_stm32_data_##index,           \
			      &mcpwm_stm32_config_##index, POST_KERNEL, CONFIG_PWM_INIT_PRIORITY,  \
			      &mcpwm_stm32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(PWM_DEVICE_INIT)
